app/views/blogs/index.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."blog_id" = ? ORDER BY "pictures"."id" DESC LIMIT 1  [["blog_id", 3]]
SELECT 1 AS one FROM "pictures" WHERE "pictures"."blog_id" = ? LIMIT 1  [["blog_id", 5]]
---
          <div class="span4 portfolio-item <%= blog.kind_name %> isotope-item">
            <% unless blog.pictures.empty? %>