app/views/blogs/show.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."blog_id" = ?  [["blog_id", 2]]
SELECT 1 AS one FROM "pictures" WHERE "pictures"."blog_id" = ? LIMIT 1  [["blog_id", 2]]
---

          <% unless @blog.pictures.empty? %>

SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC
---
            <ul>
              <% Blog.order('created_at DESC').each do |blog| %>