app/views/pages/home.html.erb

    <div class="container">
      <h2><i class="ico-keynote"></i><%= Blog.first.title %></h2>
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."id" DESC LIMIT 5

            <ul class="slides">
              <% Blog.first.pictures.each do |blog| %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."blog_id" = ?  [["blog_id", 1]]