app/views/pages/pictures.html.erb


        <% Picture.all.each do |picture| %>
---
SELECT "pictures".* FROM "pictures"

            <div class="picture", style="height: 175px"><%= link_to (image_tag picture.image(:medium)), picture.image(:original), rel: "prettyPhoto" %>
              <% if picture.blog.present? %>
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? ORDER BY "blogs"."id" ASC LIMIT 1  [["id", 2]]