app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all.order('created_at DESC').paginate(:page => params[:page], :per_page => 6)
---
SELECT "blogs".* FROM "blogs" ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "blogs" LIMIT 3 OFFSET 0) subquery_for_count

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "bbbb"], ["created_at", Fri, 21 Feb 2014 12:27:04 UTC +00:00], ["title", "aaaa"], ["updated_at", Fri, 21 Feb 2014 12:27:04 UTC +00:00]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = 3