app/controllers/pages_controller.rb

SELECT "pictures".* FROM "pictures" ORDER BY created_at DESC LIMIT 24 OFFSET 0
SELECT COUNT(*) FROM "pictures"
---
  def pictures
    @picture = Picture.new
    @pictures = Picture.all.order('created_at DESC').paginate(:page => params[:page], :per_page => 24)