app/controllers/pictures_controller.rb

  def new
    @blog = Blog.find(params[:blog_id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    if @blog.present?
      @blog = Blog.find(params[:id])
      @picture = @blog.pictures.build(picture_params)
    else
      @picture = Picture.new(picture_params)
    end

    respond_to do |format|
      if @picture.save
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "pictures" ("blog_id", "created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)